{"id":23,"date":"2016-04-02T18:36:47","date_gmt":"2016-04-02T18:36:47","guid":{"rendered":"http:\/\/ldnwebperf.org\/?page_id=23"},"modified":"2019-10-11T11:55:48","modified_gmt":"2019-10-11T11:55:48","slug":"faqs","status":"publish","type":"page","link":"https:\/\/ldnwebperf.org\/faqs\/","title":{"rendered":"FAQs"},"content":{"rendered":"<h2>What time should I arrive?<\/h2>\n<p>We usually open registration at 18:30. Please try to arrive before 18:45. Drinks will normally be available for early arrivals, so arrive early, get a great seat and enjoy a drink before the talk starts.<\/p>\n<h2>How do I get there?<\/h2>\n<p>Currently we don&#8217;t have a regular venue, so pay attention to the location details listed for the event, and <a href=\"https:\/\/twitter.com\/ldnwebperf\">follow us on twitter<\/a> for updates on entry process if there is something a bit complicated that you need to navigate!<\/p>\n<h2>What food is there?<\/h2>\n<p>Typically we serve pizza at the end of the talks, usually around 20:00 to 21:00 depending on the talk length and number of talks.  We cater to vegetarian and gluten free diets. Meetups usually end at 22:00.  If we aren&#8217;t going to be able to provide food for a particular event we&#8217;ll try to make that clear in the event description.<\/p>\n<h2>Why do I have to pay to come?<\/h2>\n<p>The £5 entry fee for the meetup is mostly to reduce the number of no-shows. If we have a big waitlist, it’s very frustrating to have turned away dozens of people and yet end up with a room that’s only half full. The ticket revenue helps to pay for the general operation of the group, and evening security at the venue.<\/p>\n<p>London Web Performance Group is a non-profit community interest company (CIC), so we are not allowed to make profit.  Any annual surplus from both sponsorship and attendance fees is donated to charity.<\/p>\n<h2>Do I have to bring my ticket and ID to the event?<\/h2>\n<p>Yes please! It really helps us if you can bring your Eventbrite paper or online ticket (containing the QR code) to the check-in desk at the event.  This is because we may have new people helping us on the desk who have no idea who any of our regular attendees are (and also Andrew is utterly hopeless at remembering names)<\/p>\n<p>Venue security reserve the right to spot check that people entering the building have government-issued ID that matches their ticket reservation. You may not be allowed to enter the meetup if you cannot prove that you are the person who registered for your ticket.<\/p>\n<h2>What is the refund policy?<\/h2>\n<p>We do not offer refunds.  If you are unable to come you can either use Eventbrite to transfer it to someone else anytime up to 6pm on the day, or if you just cancel your ticket Eventbrite will automatically offer it to someone else on the waitlist of a sold out event.<\/p>\n<h2>The name on the registration\/ticket doesn&#8217;t match the attendee. Is that okay?<\/h2>\n<p>No. Venue security reserve the right to spot check and refuse entry if you cannot prove that you are the person who ordered the ticket by producing government issued ID such as a driving licence or passport.  This policy may vary from one venue to another, but we advise you not to take the risk and make sure you have the right ticket.<\/p>\n<h2>I have accessibility needs, can I get some help?<\/h2>\n<p>Yes, of course. Email <a href=\"mailto:hello@ldnwebperf.org\">hello@ldnwebperf.org<\/a> and we’ll try and help you out.<\/p>\n<h2>Can I bring my kids?<\/h2>\n<p>Yes!  We have an arrangement with <a href=\"https:\/\/www.snuggleschildcare.co.uk\/\">Snuggles<\/a> for fully licensed and vetted child minders to look after your spawn for the duration of the meetup.  When buying a ticket, look out for the &#8216;with childcare&#8217; option.  You must buy your ticket at least a week before the event if you want to bring children so we can make sure we have time to book Snuggles.<\/p>\n<p>In some venues, we may have to provide the childcare service at a nearby hotel instead of in the venue itself, but we aim to keep your kids as close to you as possible.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What time should I arrive? We usually open registration at 18:30. Please try to arrive before 18:45. Drinks will normally be available for early arrivals, so arrive early, get a great seat and enjoy a drink before the talk starts. How do I get there? Currently we don&#8217;t have a regular venue, so pay attention to the location details listed for the event, and follow us on twitter for updates [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/ldnwebperf.org\/wp-json\/wp\/v2\/pages\/23"}],"collection":[{"href":"https:\/\/ldnwebperf.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/ldnwebperf.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/ldnwebperf.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/ldnwebperf.org\/wp-json\/wp\/v2\/comments?post=23"}],"version-history":[{"count":0,"href":"https:\/\/ldnwebperf.org\/wp-json\/wp\/v2\/pages\/23\/revisions"}],"wp:attachment":[{"href":"https:\/\/ldnwebperf.org\/wp-json\/wp\/v2\/media?parent=23"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}