{"id":25,"date":"2016-04-02T18:39:40","date_gmt":"2016-04-02T18:39:40","guid":{"rendered":"http:\/\/ldnwebperf.org\/?page_id=25"},"modified":"2019-10-11T11:39:36","modified_gmt":"2019-10-11T11:39:36","slug":"code-of-conduct","status":"publish","type":"page","link":"https:\/\/ldnwebperf.org\/code-of-conduct\/","title":{"rendered":"Code of conduct"},"content":{"rendered":"<p>We do not tolerate verbal comments or presentational material that makes inappropriate use of gender identity and expression, sexual orientation, disability, physical appearance, body size, race, age, or religion.<\/p>\n<p>We require participants to respect others&#8217; reasonable boundaries and will ask you to leave if you don&#8217;t.<\/p>\n<p>If you are having a problem with another attendee, or notice that someone else is being harassed, please contact an organiser.  We promise to listen, take your concern seriously and take appropriate action with your consent.<\/p>\n<h2>Attendee guidelines<\/h2>\n<p>If you are attending a LWP event, please:<\/p>\n<ul>\n<li>Turn up. We appreciate that life happens sometimes, but please don&#8217;t make a habit of getting a ticket and not showing up.<\/li>\n<li>Arrive on time.  Talks usually begin at 7pm and we open doors at 6:30pm.<\/li>\n<li>Remain quiet during talks, and put your phone on silent or switch it off<\/li>\n<li>Follow directions from organisers<\/li>\n<li>Respect our hosts: do not enter any area of the building not in use by the event.<\/li>\n<li>Avoid downloading large amounts of data over the wifi, and be aware that our hosts monitor the wifi traffic and reserve the right to block any activity they deem unacceptable, or MAC addresses that are abusing the network.<\/li>\n<\/ul>\n<h2>Speaker guidelines<\/h2>\n<p>If you are presenting at an LWP event, please:<\/p>\n<ul>\n<li>Send us your slides for review ahead of time of you can.  This enables us to assess the expertise level required of the audience (which is often difficult to assess as a speaker), so we can market the talk correctly, and we will also check that the content is compatible with the code of conduct.<\/li>\n<li>Avoid severe profanity or expletives in your talk, including in your slides.  Exercise some discretion here &#8211; if you wouldn&#8217;t hear it on TV before 9pm, don&#8217;t include it in your talk (unless you&#8217;re quoting it being said by someone else)<\/li>\n<li>Avoid criticising other organisations without proper justification.  &#8220;We were disappointed to see that the latest iOS build still lacks IndexedDB support&#8221; is perfectly fine.  &#8220;Apple sucks&#8221; is childish.<\/li>\n<li>Humour is fine, but don&#8217;t make jokes at other people&#8217;s or organisations&#8217; expense.  Don&#8217;t pander to stereotypes (even &#8216;safe&#8217; ones, or ones that you are applying to yourself).<\/li>\n<li>Platform developers, particularly browser vendors, are understandably unimpressed if speakers refer to browser faults without having reported them.  If you include a browser fault in your talk make sure you&#8217;ve either reported it or there&#8217;s already a bug report for it, and if possible reference the issue number in the vendor&#8217;s bug tracker.<\/li>\n<li>Avoid unnecessary jargon.  The <a href=\"https:\/\/cdn.static-economist.com\/sites\/default\/files\/store\/Style_Guide_2015.pdf\">Economist style guide<\/a> is really good.  Especially avoid business jargon, which just makes you sound like you have no idea what you&#8217;re talking about.<\/li>\n<li>Avoid using the term ‘guys’ where ‘people’ or ‘folks’ will do. Even if you’re referring to a known group of people that is entirely male, call them people anyway.<\/li>\n<li>Arrive at least 30 mins before your talk is due to start.<\/li>\n<\/ul>\n<h2>Organiser conduct<\/h2>\n<p>The organisers of London Web Performance are employees of respected organisations and are bound by the codes of conduct of their employers.  If you have any concerns about the conduct of an organiser, please approach either a different organiser or the HR department of their employer:<\/p>\n<ul>\n<li>Andrew Betts: Fastly<\/li>\n<li>Simon Hearne: Akamai Technologies<\/li>\n<li>Andy Davies is an independent consultant<\/li>\n<\/ul>\n\n\n<p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>We do not tolerate verbal comments or presentational material that makes inappropriate use of gender identity and expression, sexual orientation, disability, physical appearance, body size, race, age, or religion. We require participants to respect others&#8217; reasonable boundaries and will ask you to leave if you don&#8217;t. If you are having a problem with another attendee, or notice that someone else is being harassed, please contact an organiser.  We promise to [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/ldnwebperf.org\/wp-json\/wp\/v2\/pages\/25"}],"collection":[{"href":"https:\/\/ldnwebperf.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/ldnwebperf.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/ldnwebperf.org\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/ldnwebperf.org\/wp-json\/wp\/v2\/comments?post=25"}],"version-history":[{"count":0,"href":"https:\/\/ldnwebperf.org\/wp-json\/wp\/v2\/pages\/25\/revisions"}],"wp:attachment":[{"href":"https:\/\/ldnwebperf.org\/wp-json\/wp\/v2\/media?parent=25"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}